# Ultralytics YOLO 🚀, GPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 14  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]
activation: nn.ReLU()

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 5, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

    # Decoupled Head:
   [17, 1, Conv, [128, 1, 1]],  # 24 lateral0 (P3/8-small)
   [20, 1, Conv, [256, 1, 1]],  # 25 lateral1 (P4/16-medium)
   [23, 1, Conv, [512, 1, 1]],  # 26 lateral2 (P5/32-large)

    # coco2017object
   [24, 1, Conv, [128, 3, 1]],  # 27 cls0 (P3/8-small)
   [-1, 1, Conv, [128, 3, 1]],  # 28 cls0 (P3/8-small)
   [24, 1, Conv, [128, 3, 1]],  # 29 reg0 (P3/8-small)
   [-1, 1, Conv, [128, 3, 1]],  # 30 reg0 (P3/8-small)

   [25, 1, Conv, [256, 3, 1]],  # 31 cls1 (P4/16-medium)
   [-1, 1, Conv, [256, 3, 1]],  # 32 cls1 (P4/16-medium)
   [25, 1, Conv, [256, 3, 1]],  # 33 reg1 (P4/16-medium)
   [-1, 1, Conv, [256, 3, 1]],  # 34 reg1 (P4/16-medium)

   [26, 1, Conv, [512, 3, 1]],  # 35 cls2 (P5/32-large)
   [-1, 1, Conv, [512, 3, 1]],  # 36 cls2 (P5/32-large)
   [26, 1, Conv, [512, 3, 1]],  # 37 reg2 (P5/32-large)
   [-1, 1, Conv, [512, 3, 1]],  # 38 reg2 (P5/32-large)

    # DoorObject@Object
   [24, 1, Conv, [128, 3, 1]],  # 39 cls0 (P3/8-small)
   [-1, 1, Conv, [128, 3, 1]],  # 40 cls0 (P3/8-small)
   [24, 1, Conv, [128, 3, 1]],  # 41 reg0 (P3/8-small)
   [-1, 1, Conv, [128, 3, 1]],  # 42 reg0 (P3/8-small)

   [25, 1, Conv, [256, 3, 1]],  # 43 cls1 (P4/16-medium)
   [-1, 1, Conv, [256, 3, 1]],  # 44 cls1 (P4/16-medium)
   [25, 1, Conv, [256, 3, 1]],  # 45 reg1 (P4/16-medium)
   [-1, 1, Conv, [256, 3, 1]],  # 46 reg1 (P4/16-medium)

   [26, 1, Conv, [512, 3, 1]],  # 47 cls2 (P5/32-large)
   [-1, 1, Conv, [512, 3, 1]],  # 48 cls2 (P5/32-large)
   [26, 1, Conv, [512, 3, 1]],  # 49 reg2 (P5/32-large)
   [-1, 1, Conv, [512, 3, 1]],  # 50 reg2 (P5/32-large)


   [[30, 34, 38], 1, Detect, [12]],  # 51 Detect(P3, P4, P5)
   [[42, 46, 50], 1, Detect, [2]],  # 52 Detect(P3, P4, P5)

#   [[30, 34, 38], 1, SidaBranchDetect, [14]],  # 51 Detect(P3, P4, P5)
#   [[42, 46, 50], 1, SidaBranchDetect, [2]],  # 52 Detect(P3, P4, P5)

   [[51, 52], 1, SidaDetectMerge, [nc,[12, 2]]],
  ]